<a target="_blank" href="https://colab.research.google.com/github/nascarsayan/diy-python/blob/master/cricketData.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

### ODI Batting analysis

- We read the data from the csv filepath `datasets/cricketData/Batting/ODI.csv`
- If the file is not present:
    - we create the necessary directories
    - we download the file from the url to the filepath

In [1]:
import os
fpath = os.path.join(
    "datasets",
    "cricketData",
    "Batting",
    "ODI.csv"
)

# ./datasets/cricketData/Batting/ODI.csv

# if fpath does not exist download it 
# and save it to the above path

url = "https://github.com/nascarsayan/diy-python/raw/master/datasets/cricketData/Batting/ODI.csv"
if not os.path.exists(fpath):

    # Create the nessary directories if they don't exist
    os.makedirs(os.path.dirname(fpath), exist_ok=True)
    
    # This is how we can make an HTTP GET request
    # and save the response to a file
    import urllib.request
    urllib.request.urlretrieve(url, fpath)

- `with` is used to automatically close the file when the block is exited
- `open` is a built-in function that opens a file and returns a file object
- `readlines` is a method that reads all the lines of a file into memory and returns a list of strings

In [22]:
with open(fpath) as f:
    content = f.readlines()

# f = open(fpath)
# content = f.readlines()
# f.close()

print(content[:30])

[',Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13\n', '0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49,96,20,\n', '1,KC Sangakkara (Asia/ICC/SL),2000-2015,404,380,41,14234,169,41.98,18048,78.86,25,93,15,\n', '2,RT Ponting (AUS/ICC),1995-2012,375,365,39,13704,164,42.03,17046,80.39,30,82,20,\n', '3,ST Jayasuriya (Asia/SL),1989-2011,445,433,18,13430,189,32.36,14725,91.2,28,68,34,\n', '4,DPMD Jayawardene (Asia/SL),1998-2015,448,418,39,12650,144,33.37,16020,78.96,19,77,28,\n', '5,Inzamam-ul-Haq (Asia/PAK),1991-2007,378,350,53,11739,137*,39.52,15812,74.24,10,83,20,\n', '6,V Kohli (INDIA),2008-2019,242,233,39,11609,183,59.84,12445,93.28,43,55,13,\n', '7,JH Kallis (Afr/ICC/SA),1996-2014,328,314,53,11579,139,44.36,15885,72.89,17,86,17,\n', '8,SC Ganguly (Asia/INDIA),1992-2007,311,300,23,11363,183,41.02,15416,73.7,22,72,16,\n', '9,R Dravid (Asia/ICC/INDIA),1996-2011,344,318,40,10889,153,39.16,15284,71.24,12,83,13,\n', '10,MS Dhoni (Asia/INDIA),2004-2019,350,297,84,10773,183*,50.57,12303,87.56,10,73,10,\n', '11,CH Gayle (ICC/WI),1999-2019,301,294,17,10480,215,37.83,12019,87.19,25,54,25,\n', '12,BC Lara (ICC/WI),1990-2007,299,289,32,10405,169,40.48,13086,79.51,19,63,16,\n', '13,TM Dilshan (SL),1999-2016,330,303,41,10290,161*,39.27,11933,86.23,22,47,11,\n', '14,Mohammad Yousuf (Asia/PAK),1998-2010,288,273,40,9720,141*,41.71,12942,75.1,15,64,15,\n', '15,AC Gilchrist (AUS/ICC),1996-2008,287,279,11,9619,172,35.89,9922,96.94,16,55,19,\n', '16,AB de Villiers (Afr/SA),2005-2018,228,218,39,9577,176,53.5,9473,101.09,25,53,7,\n', '17,M Azharuddin (INDIA),1985-2000,334,308,54,9378,153*,36.92,12669,74.02,7,58,9,\n', '18,PA de Silva (SL),1984-2003,308,296,30,9284,145,34.9,11443,81.13,11,64,17,\n', '19,RG Sharma (INDIA),2007-2019,221,214,32,8944,264,49.14,10063,88.88,28,43,13,\n', '20,Saeed Anwar (PAK),1989-2003,247,244,19,8824,194,39.21,10938,80.67,20,43,15,\n', '21,S Chanderpaul (WI),1994-2011,268,251,40,8778,150,41.6,12408,70.74,11,59,6,\n', '22,Yuvraj Singh (Asia/INDIA),2000-2017,304,278,40,8701,150,36.55,9924,87.67,14,52,18,\n', '23,DL Haynes (WI),1978-1994,238,237,28,8648,152*,41.37,13707,63.09,17,57,13,\n', '24,MS Atapattu (SL),1990-2007,268,259,32,8529,132*,37.57,12594,67.72,11,59,13,\n', '25,ME Waugh (AUS),1988-2002,244,236,20,8500,173,39.35,11053,76.9,18,50,16,\n', '26,LRPL Taylor (NZ),2006-2019,228,212,37,8376,181*,47.86,10091,83.0,20,50,9,\n', '27,V Sehwag (Asia/ICC/INDIA),1999-2013,251,245,9,8273,219,35.05,7929,104.33,15,38,14,\n', '28,HM Amla (SA),2008-2019,181,178,14,8113,159,49.46,9178,88.39,27,39,4,\n']

In [23]:
import csv
import json
with open(fpath) as f:
    reader = csv.DictReader(f)
    data = [row for row in reader]
print(json.dumps(data[:1], indent=2))
del data

[
  {
    "": "0",
    "Player": "SR Tendulkar (INDIA)",
    "Span": "1989-2012",
    "Mat": "463",
    "Inns": "452",
    "NO": "41",
    "Runs": "18426",
    "HS": "200*",
    "Ave": "44.83",
    "BF": "21367",
    "SR": "86.23",
    "100": "49",
    "50": "96",
    "0": "20",
    "Unnamed: 13": ""
  }
]

In [24]:
# Get dataframe
import pandas as pd
with open(fpath) as f:
    df = pd.read_csv(f)

# some cells hav a '-' in them, we need to convert them to NaN
df = df.replace('-', pd.NA)

## rename the column "Unnamed: 0" to "Sl. No."
df = df.rename(columns={"Unnamed: 0": "Sl. No."})   
 # drop SL. No. column
df = df.drop(columns=["Sl. No."])

In [25]:
df[:2]

,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49,96,20,NaN
1,KC Sangakkara (Asia/ICC/SL),2000-2015,404,380,41,14234,169,41.98,18048,78.86,25,93,15,NaN

In [21]:
# Get the player with the highest number of runs
# remove NaN values, and convert the column to float
df2 = df.dropna(subset=['Runs'])
df2.loc[:, 'Runs'] = df2['Runs'].astype(float)
df2[df2['Runs'] == df2['Runs'].max()]

,Sl. No.,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
0,0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426.0,200*,44.83,21367,86.23,49,96,20,NaN

In [26]:
# sort by number of matches played
df2 = df.dropna(subset=['Mat'])
df2.loc[:, 'Mat'] = df2['Mat'].astype(float)
df2 = df2.sort_values(by='Mat', ascending=False)
df2[:3]

,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49,96,20,NaN
4,DPMD Jayawardene (Asia/SL),1998-2015,448,418,39,12650,144,33.37,16020,78.96,19,77,28,NaN
3,ST Jayasuriya (Asia/SL),1989-2011,445,433,18,13430,189,32.36,14725,91.2,28,68,34,NaN

In [18]:
### Sort by number of centuries
df2 = df.dropna(subset=['100'])
df2.loc[:, '100'] = df2['100'].astype(float)
df2 = df2.sort_values(by='100', ascending=False)
df2[:3]

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
0,0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49.0,96,20,NaN
6,6,V Kohli (INDIA),2008-2019,242,233,39,11609,183,59.84,12445,93.28,43.0,55,13,NaN
2,2,RT Ponting (AUS/ICC),1995-2012,375,365,39,13704,164,42.03,17046,80.39,30.0,82,20,NaN

In [10]:
# Get the players who scored more 100s than 50s, sort by number of 100s
df2 = df.dropna(subset=['100', '50'])
df2.loc[:, '100'] = df2['100'].astype(float)
df2.loc[:, '50'] = df2['50'].astype(float)
df2 = df2[df2['100'] > df2['50']]
df2 = df2.sort_values(by='100', ascending=False)
df2[:3]

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
263,13,Imam-ul-Haq (PAK),2017-2019,37,37,5,1723,151,53.84,2141,80.47,7.0,6.0,2,NaN
298,48,SO Hetmyer (WI),2017-2019,43,40,3,1416,139,38.27,1323,107.02,5.0,4.0,2,NaN
433,33,DL Amiss (ENG),1972-1977,18,18,0,859,137,47.72,1185,72.48,4.0,1.0,0,NaN

In [11]:
### Get the players with top highest scores
df2 = df.dropna(subset=['HS'])
# if it ends with *, remove *
df2.loc[:, 'HS'] = df2['HS'].str.replace('*', '')
# try to convert to int, if it fails, replace with NaN
df2.loc[:, 'HS'] = pd.to_numeric(df2['HS'], errors='coerce')
df2 = df2.dropna(subset=['HS'])
df2 = df2.sort_values(by='HS', ascending=False)
df2[:3]

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
19,19,RG Sharma (INDIA),2007-2019,221,214,32,8944,264,49.14,10063,88.88,28,43,13,NaN
48,48,MJ Guptill (NZ),2009-2019,179,176,19,6626,237,42.2,7586,87.34,16,35,15,NaN
27,27,V Sehwag (Asia/ICC/INDIA),1999-2013,251,245,9,8273,219,35.05,7929,104.33,15,38,14,NaN

In [27]:
### Sort by strike rate, then by average. 
# Only consider players who scored 
# >= 1000 runs in their career
df2 = df.dropna(subset=['SR', 'Ave', 'Runs'])
df2.loc[:, 'Runs'] = df2['Runs'].astype(float)
df2 = df2[df2['Runs'] >= 1000]
df2.loc[:, 'SR'] = df2['SR'].astype(float)
df2.loc[:, 'Ave'] = df2['Ave'].astype(float)
df2 = df2.sort_values(by=['SR', 'Ave'], ascending=False)
df2[:3]

,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
378,AD Russell (WI),2011-2019,56,47,9,1034.0,92*,27.21,794,130.22,0,4,6,NaN
160,GJ Maxwell (AUS),2012-2019,110,100,11,2877.0,102,32.32,2332,123.37,1,19,9,NaN
116,JC Buttler (ENG),2012-2019,142,117,23,3843.0,150,40.88,3207,119.83,9,20,12,NaN

In [29]:
### Sort by average, then by strike rate 
# Only consider players who scored 
# >= 1000 runs in their career
df2 = df.dropna(subset=['SR', 'Ave', 'Runs'])
df2.loc[:, 'Runs'] = df2['Runs'].astype(float)
df2 = df2[df2['Runs'] >= 1000]
df2.loc[:, 'SR'] = df2['SR'].astype(float)
df2.loc[:, 'Ave'] = df2['Ave'].astype(float)
df2 = df2.sort_values(by=['Ave', 'SR'], ascending=False)
df2[:3]

,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
285,RN ten Doeschate (NL),2006-2011,33,32,9,1541.0,119,67.0,1757,87.7,5,9,1,NaN
6,V Kohli (INDIA),2008-2019,242,233,39,11609.0,183,59.84,12445,93.28,43,55,13,NaN
139,Babar Azam (PAK),2015-2019,74,72,10,3359.0,125*,54.17,3857,87.08,11,15,2,NaN